Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/std_drv/src/bl602_spi.c
        recvBuff[txLen - tmpVal] = BL_RD_REG(SPIx, SPI_FIFO_RDATA) & 0xffffff;
        BL_WR_REG(SPIx, SPI_FIFO_WDATA, sendBuff[txLen]);
    }

    /* Wait receive the rest of the data */
    for (txLen = 0; txLen < tmpVal; txLen++) {
        timeoutCnt = SPI_RX_TIMEOUT_COUNT;

        while (SPI_GetRxFifoCount(spiNo) == 0) {
            if (timeoutType) {
                timeoutCnt--;

                if (timeoutCnt == 0) {
                    return TIMEOUT;
                }
            }
        }

        recvBuff[length - tmpVal + txLen] = BL_RD_REG(SPIx, SPI_FIFO_RDATA) & 0xffffff;
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  SPI send and receive 32-bit datas at the same time
 *
 * @param  spiNo: SPI ID type
 * @param  sendBuff: Buffer of datas to send
 * @param  recvBuff: Buffer of datas received
 * @param  length: Length of buffer
 * @param  timeoutType: Enable or disable timeout judgment
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type SPI_SendRecv_32bits(SPI_ID_Type spiNo, uint32_t *sendBuff, uint32_t *recvBuff, uint32_t length, SPI_Timeout_Type timeoutType)
{
    uint32_t tmpVal;
    uint32_t txLen = 0;
    uint32_t SPIx = spiAddr[spiNo];
    uint32_t timeoutCnt = SPI_RX_TIMEOUT_COUNT;

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
    CHECK_PARAM(IS_SPI_TIMEOUT_TYPE(timeoutType));

    /* Set valid width for each fifo entry */
    tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
    BL_WR_REG(SPIx, SPI_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_FRAME_SIZE, 3));

    /* Disable rx ignore */
    tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
    BL_WR_REG(SPIx, SPI_CONFIG, BL_CLR_REG_BIT(tmpVal, SPI_CR_SPI_RXD_IGNR_EN));

    /* Clear tx and rx fifo */
    tmpVal = BL_RD_REG(SPIx, SPI_FIFO_CONFIG_0);
    tmpVal = BL_SET_REG_BIT(tmpVal, SPI_TX_FIFO_CLR);
    tmpVal = BL_SET_REG_BIT(tmpVal, SPI_RX_FIFO_CLR);
    BL_WR_REG(SPIx, SPI_FIFO_CONFIG_0, tmpVal);

    /* Fill tx fifo */
    tmpVal = length <= (SPI_TX_FIFO_SIZE) ? length : SPI_TX_FIFO_SIZE;

    for (txLen = 0; txLen < tmpVal; txLen++) {
        BL_WR_REG(SPIx, SPI_FIFO_WDATA, sendBuff[txLen]);
    }

    /* Wait receive data and send the rest of the data */
    for (; txLen < length; txLen++) {
        timeoutCnt = SPI_RX_TIMEOUT_COUNT;

        while (SPI_GetRxFifoCount(spiNo) == 0) {
            if (timeoutType) {
                timeoutCnt--;

                if (timeoutCnt == 0) {
                    return TIMEOUT;
                }
            }
        }

        recvBuff[txLen - tmpVal] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
        BL_WR_REG(SPIx, SPI_FIFO_WDATA, sendBuff[txLen]);
    }

    /* Wait receive the rest of the data */
    for (txLen = 0; txLen < tmpVal; txLen++) {
        timeoutCnt = SPI_RX_TIMEOUT_COUNT;

        while (SPI_GetRxFifoCount(spiNo) == 0) {
            if (timeoutType) {
                timeoutCnt--;

                if (timeoutCnt == 0) {
                    return TIMEOUT;
                }
            }
        }

        recvBuff[length - tmpVal + txLen] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  SPI read data from rx fifo
 *
 * @param  spiNo: SPI ID type
 *
 * @return Data readed
 *
*******************************************************************************/
uint32_t SPI_ReceiveData(SPI_ID_Type spiNo)
{
    uint32_t SPIx = spiAddr[spiNo];

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

    return BL_RD_REG(SPIx, SPI_FIFO_RDATA);
}

/****************************************************************************/ /**
 * @brief  Get tx fifo available count value function
 *
 * @param  spiNo: SPI ID type
 *
 * @return Count value
 *
*******************************************************************************/
uint8_t SPI_GetTxFifoCount(SPI_ID_Type spiNo)
{
    uint32_t SPIx = spiAddr[spiNo];

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

    /* Get count value */
    return BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_TX_FIFO_CNT);
}

/****************************************************************************/ /**
 * @brief  Get rx fifo available count value function
 *
 * @param  spiNo: SPI ID type
 *
 * @return Count value
 *
*******************************************************************************/
uint8_t SPI_GetRxFifoCount(SPI_ID_Type spiNo)
{
    uint32_t SPIx = spiAddr[spiNo];

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

    /* Get count value */
    return BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT);
}

/****************************************************************************/ /**
 * @brief  Get spi interrupt status
 *
 * @param  spiNo: SPI ID type
 * @param  intType: SPI interrupt type
 *
 * @return Status of interrupt
 *
*******************************************************************************/
BL_Sts_Type SPI_GetIntStatus(SPI_ID_Type spiNo, SPI_INT_Type intType)
{
    uint32_t tmpVal;
    uint32_t SPIx = spiAddr[spiNo];

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
    CHECK_PARAM(IS_SPI_INT_TYPE(intType));

    /* Get certain or all interrupt status */
    tmpVal = BL_RD_REG(SPIx, SPI_INT_STS);

    if (SPI_INT_ALL == intType) {
        if ((tmpVal & 0x3f) != 0) {
            return SET;
        } else {
            return RESET;
        }
    } else {
        if ((tmpVal & (1U << intType)) != 0) {
            return SET;
        } else {
            return RESET;
        }
    }
}

/****************************************************************************/ /**
 * @brief  Get indicator of spi bus busy
 *
 * @param  spiNo: SPI ID type
 *
 * @return Status of spi bus
 *
*******************************************************************************/
BL_Sts_Type SPI_GetBusyStatus(SPI_ID_Type spiNo)
{
    uint32_t tmpVal;
    uint32_t SPIx = spiAddr[spiNo];

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

    /* Get bus busy status */
    tmpVal = BL_RD_REG(SPIx, SPI_BUS_BUSY);

    if (BL_IS_REG_BIT_SET(tmpVal, SPI_STS_SPI_BUS_BUSY)) {
        return SET;
    } else {
        return RESET;
    }
}

/****************************************************************************/ /**
 * @brief  Get tx/rx fifo overflow or underflow status
 *
 * @param  spiNo: SPI ID type
 * @param  fifoSts: Select tx/rx overflow or underflow
 *
 * @return Status of tx/rx fifo
 *
*******************************************************************************/
BL_Sts_Type SPI_GetFifoStatus(SPI_ID_Type spiNo, SPI_FifoStatus_Type fifoSts)
{
    uint32_t tmpVal;
    uint32_t SPIx = spiAddr[spiNo];

    /* Check the parameters */
    CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
    CHECK_PARAM(IS_SPI_FIFOSTATUS_TYPE(fifoSts));

    /* Get tx/rx fifo overflow or underflow status */
    tmpVal = BL_RD_REG(SPIx, SPI_FIFO_CONFIG_0);

    if ((tmpVal & (1U << (fifoSts + SPI_TX_FIFO_OVERFLOW_POS))) != 0) {
        return SET;
    } else {
        return RESET;
    }
}

/****************************************************************************/ /**
 * @brief  SPI interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void SPI_IRQHandler(void)
{
    SPI_IntHandler(SPI_ID_0);
}
#endif

/*@} end of group SPI_Public_Functions */

/*@} end of group SPI */

/*@} end of group BL602_Peripheral_Driver */
